<?php

function debug($arr){
    echo '<pre>' . print_r($arr, true) . '</pre>';
}

function redirect($http = false){
    if($http){
        $redirect = $http;
    }else {
        $redirect = isset($_SERVER['HTTP_REFERER']) ? $_SERVER['HTTP_REFERER'] : PATH;
    }
    header($redirect);
    exit;
}

function glossary(){

return array(
    'bd' => 'День рождения' ,
    'tn' => 'Номер телефона',
    'el' => 'E-mail',
    'ws' => 'Веб-сайт',
    'ft' => 'Фото',
    'am' => 'О себе',
    'ac' => 'О компании',
    'ic' => 'Познакомимся ближе',
    'lam' => 'Немного о себе',
    'pi' => 'Персональная информация',
    'rm' => 'Резюме',
    'kn' => 'Мои знания и достижения',
    'wr' => 'Работа',
    'st' => 'Учеба',
    'pf' => 'Портфолио',
    'lw' => 'Мои разработки',
    'dc' => 'Описание работы',
    'lk' => 'Посмотреть',
    'cn' => 'Контакты',
    'lm' => 'Оставьте ваше сообщение',
    'ad' => 'Адрес',
    'tf' => 'Телефон',
    'yn' => 'Ваше имя',
    'ye' => 'Ваш E-mail',
    'ym' => 'Ваше сообщение',
    'sd' => 'Отправить',
    'ee' => 'Не корректно введен E-mail',
    'en' => 'Вы не ввели имя',
    'em' => 'Вы не ввели сообщение',
    'bp' => 'Бессплатно по России',
    'in' => 'Вход',
    'rg' => 'Регистрация',
    'cl' => 'Обратный звонок',
    'ww' => 'Пн-Пт:',
    'ss' => 'Сб-Вс:',
    'dw' => '09:00-21:00',
    'ds' => '10:00-20:00',
    'ct' => 'Каталог товаров',
    'nw' => 'Новости',
    'oz' => 'Отзывы',
    'fd' => 'Найти',
    'cs' => 'Выбрано',
    'al' => 'Везде',
    'er' => 'Ошибка',
    'td' => 'Товар дня',
    'nt' => 'Новинка',
    'bn' =>'Скидка дня',
    'id' =>'Подробнее',
    'hp' => 'Помощь',
    'if' => 'Информация',
    'br' => 'Бренды',
    'py' => 'Оплата',
    'wr' => 'Гарантия',
    'dl' => 'Доставка',
    'sl' => 'Распродажа',
    'stc' => 'в наличии',
    'pzk' => 'под заказ',
    'pop' => 'Популярные товары'
);
}

function maderec($text,$m=0,$sel=';'){
    $aa='';$tt='|';
    if(is_array($text)){
	    foreach($text as $val) {
		    $aa.=$val.$sel;
		    $tt .=$sel; 
	    }	
	    if($m == 0)$aa.=$tt;
    }
elseif($m == 0) $aa.=$text.';|;;';
else $aa =  $text.$sel;
return $aa;
}